[Basic Data Exploration](#basic-explor)

[Bivariate analysis](#bivar)

## Course Structure

1. Module 0 - Native Data Types in Python
2. Module 1 - Intro to Pandas library & Basis Dataframe attributes
3. Module 2 - Common Data manipulation tasks using Pandas
4. Module 3 - Loops and Functions 
5. Module 4 - Visualization
6. Module 5 - Other miscellaneous topics

# Basic data types

In [ ]:
# from IPython.core.interactiveshell import InteractiveShell
# InteractiveShell.ast_node_interactivity = "all"

In [ ]:
x = [1,"b",3]

In [ ]:
x[1]

In [ ]:
student_dict = {"s_1":["IBM","TCS"],
                "s_2" :["HP"],
                "s_3":["INFOSYS","WIPRO"]}

In [ ]:
[val for k,val in student_dict.items()]

In [ ]:
x = ["abe",1,"c"]

In [ ]:
dist_ex = {"S1":["HCL","TCS"],
           "S2":["Benz"]}

In [ ]:
for k, val in dist_ex.items():
    if k == "S1":
        print(k)

In [ ]:
x.append("h")

In [ ]:
x

In [ ]:
tup_ex = (1,2,3,1)

In [ ]:
list_ex = [1,2,3]
dist_ex = {"Age":25,"Weight":70}

tup_ex = (1,2,3,9)

In [ ]:
tup_ex.index(9)

In [160]:
# read the data
import pandas as pd
import numpy as np
df = pd.read_csv("Uber Drives 2016.csv")
df

,START_DATE*,END_DATE*,CATEGORY*,START*,STOP*,MILES*,PURPOSE*
0,1/1/2016 21:11,1/1/2016 21:17,Business,Fort Pierce,Fort Pierce,5.1,Meal/Entertain
1,1/2/2016 1:25,1/2/2016 1:37,Business,Fort Pierce,Fort Pierce,5.0,NaN
2,1/2/2016 20:25,1/2/2016 20:38,Business,Fort Pierce,Fort Pierce,4.8,Errand/Supplies
3,1/5/2016 17:31,1/5/2016 17:45,Business,Fort Pierce,Fort Pierce,4.7,Meeting
4,1/6/2016 14:42,1/6/2016 15:49,Business,Fort Pierce,West Palm Beach,63.7,Customer Visit
...,...,...,...,...,...,...,...
1151,12/31/2016 13:24,12/31/2016 13:42,Business,Kar?chi,Unknown Location,3.9,Temporary Site
1152,12/31/2016 15:03,12/31/2016 15:38,Business,Unknown Location,Unknown Location,16.2,Meeting
1153,12/31/2016 21:32,12/31/2016 21:50,Business,Katunayake,Gampaha,6.4,Temporary Site
1154,12/31/2016 22:08,12/31/2016 23:51,Business,Gampaha,Ilukwatta,48.2,Temporary Site
1155,Totals,NaN,NaN,NaN,NaN,12204.7,NaN

In [ ]:
df = pd.read_csv("Uber Drives 2016.csv")

# Key Modules

1. Basic Dataframe operations
2. Common data manipulation tasks
3. Loops and Functions

## Basic dataframe operations

In [ ]:
df.head()

In [ ]:
df.shape

In [ ]:
# hasattr(df,"head")
# callable(getattr(df,"head"))

In [ ]:
df.tail()

In [ ]:
df.dtypes

In [ ]:
df

### Changing data types

In [ ]:
temp = pd.DataFrame({"A":["1","2","3"],
                     "B":[11,12,13],
                     "C": ["12-06-2012","13-06-2015","15-06-2017"]})

In [ ]:
temp.dtypes

In [ ]:
temp["C"] = pd.to_datetime(temp["C"])

In [ ]:
temp["A"] = pd.to_numeric(temp["A"])

In [ ]:
temp.dtypes

In [ ]:

temp["A"] = temp["A"].astype(str)

In [ ]:
temp.dtypes

In [ ]:
from datetime import datetime, date, time

In [ ]:
temps = pd.to_datetime(["2002-02-19", "abc"], errors = "coerce")
temps

In [ ]:
# convert data to datetime format
# pd.to_datetime(df["START_DATE*"],format='%m/%d/%Y %H:%M')
# Available time formats: https://docs.python.org/3/library/datetime.html#strftime-and-strptime-behavior

### Dataset summarization methods

In [ ]:
df.describe(include="all")

In [ ]:
df.info()

In [ ]:
# count of unique start locations
df["STOP*"].value_counts()

## Common data manipulation tasks

5 verbs of data manipulation

1. Selecting/Indexing
2. Filtering
3. Sorting
4. Mutating/ Conditionally adding columns
5. Groupby/Summarize

### Select/Indexing

In [ ]:
df.iloc[0:7,0:4]

In [ ]:
df

In [ ]:
df.shape

In [ ]:
ebrahim = df.iloc[:,:-1]
ebrahim

In [ ]:
ebrahim.shape

In [ ]:
df.iloc[0:4    ,    [0,3]]

In [ ]:
## Positional Indexing
df.iloc[0:4,[0,1]]
df.columns

In [ ]:
df.iloc[0:4,0:3]

In [ ]:
# label based indexing
df11 = df.loc[:,["START_DATE*","CATEGORY*"]]
df11.head()

In [ ]:
df[["START_DATE*","STOP*"]]

In [ ]:
abc = df.loc[:,"START*"]
abc

In [ ]:
df.loc[:,("START*")] # "STOP*"

In [ ]:
type(abc)

### In Class assignment

Extract first 5 rows and columns START_DATE* and MILES*

### Filtering

In [ ]:
df

In [ ]:
#df[df["MILES*"] > 10]
df2 = df.loc[df["MILES*"] > 10,["MILES*"]]
df2.head()

In [ ]:
# find out all rides greater than 10 miles
df.loc[   df["MILES*"] > 10 ]

In [ ]:
# Find out all rides from New York
df.loc[    df["START*"]=="New York"    ,      ["MILES*"]    ]

In [ ]:
# Find out all rides to Cary & Morrisville          
df[df["START*"].isin(["Cary","Morrisville"])]

In [ ]:
# Find out all rides to Cary & Morrisville          
df.loc[df["START*"].isin(["Cary","Morrisville"])]

In [ ]:
df.loc[~df["START*"].isin(["Cary","Morrisville"])]

#### In class assignment

1. Find all trips with distance > 10 miles and originating from Cary and Morrisville.

2. Extract top 3 rows from the filtered dataset

In [ ]:
df3 = df.loc[(df["MILES*"] > 10) & (df["START*"].isin(["Cary","Morrisville"]))]
df3.reset_index(inplace = True, drop = True)
df3

### Sorting

In [ ]:
df.sort_values(by=["MILES*"],ascending=False).head(5)

In [ ]:
df.sort_values(by=["START*", "MILES*"],ascending=[True,False]).head(5)

### Conditionally adding columns

In [ ]:
import numpy as np
df["miles_cat"] = np.where(df["MILES*"] > 5,"Long Trip","Short Trip")

In [ ]:
df.head()

In [ ]:
df["My_Year"] = np.array(2016)
df

In [ ]:
df["miles_cat"].value_counts()

In [ ]:
df.loc[df["MILES*"] > 5].shape

## In class Assignment

Create a new column with the following condition:

a) > 10 - Long Trip

b) 5 - 10  - Medium

c) < 5 - Short Trip

In [ ]:
df["NewMiles"] = np.where(df["MILES*"] < 5,"Short Trip",np.where(df["MILES*"] > 10,"Long Trip","Medium Trip"))
df.head()

### Groupby Summarize

In [161]:
df.groupby(["START*"])["MILES*"].mean()

START*
Agnew                2.775000
Almond              15.200000
Apex                 5.341176
Arabi               17.000000
Arlington            4.900000
                      ...
West University      2.200000
Weston               4.000000
Westpark Place       2.182353
Whitebridge          4.020588
Winston Salem      133.600000
Name: MILES*, Length: 177, dtype: float64

In [162]:
df.groupby(["START*","STOP*"])["MILES*"].agg(["mean","sum"])

                                        mean    sum
START*        STOP*
Agnew         Agnew                 2.200000    2.2
              Cory                  4.300000    4.3
              Renaissance           2.300000    4.6
Almond        Bryson City          15.200000   15.2
Apex          Apex                  2.150000    4.3
...                                      ...    ...
Whitebridge   Wayne Ridge           7.975000   31.9
              Westpark Place        2.242857   31.4
              Whitebridge           2.014286   14.1
              Williamsburg Manor    8.300000    8.3
Winston Salem Asheville           133.600000  133.6

[363 rows x 2 columns]

In [163]:
# for each start loc find the mean distance travelled
df.groupby(["START*"])["MILES*"].agg(["mean"]).head() # agg is aggration function

                mean
START*
Agnew       2.775000
Almond     15.200000
Apex        5.341176
Arabi      17.000000
Arlington   4.900000

In [164]:
# for each start loc find the mean & the total dist travelled
df.groupby("START*")["MILES*"].agg(["mean","sum"]).head()

                mean   sum
START*
Agnew       2.775000  11.1
Almond     15.200000  15.2
Apex        5.341176  90.8
Arabi      17.000000  17.0
Arlington   4.900000   4.9

### In class assignment

Find most recent & the earliest travelled date and mean distance traveled for each start city

In [166]:
df = df.iloc[0:-1,:]
df.tail()
df["START_DATE*"] = pd.to_datetime(df["START_DATE*"])
df.dtypes

START_DATE*    datetime64[ns]
END_DATE*      datetime64[ns]
CATEGORY*              object
START*                 object
STOP*                  object
MILES*                float64
PURPOSE*               object
dtype: object

In [230]:
res = df.groupby(["START*"]).agg({"MILES*":["mean"],"START_DATE*":["min","max"]})
res.reset_index(inplace = True)
res.columns = ["START_CITY","AVG_DIST","EARLIEST_TRIP","RECENT_TRIP"]
res

          START_CITY    AVG_DIST       EARLIEST_TRIP         RECENT_TRIP
0              Agnew    2.775000 2016-11-04 21:04:00 2016-11-06 10:50:00
1             Almond   15.200000 2016-10-30 12:58:00 2016-10-30 12:58:00
2               Apex    5.341176 2016-01-29 21:21:00 2016-12-12 14:26:00
3              Arabi   17.000000 2016-06-25 10:50:00 2016-06-25 10:50:00
4          Arlington    4.900000 2016-08-02 11:51:00 2016-08-02 11:51:00
..               ...         ...                 ...                 ...
171  West University    2.200000 2016-03-10 14:39:00 2016-03-16 18:43:00
172           Weston    4.000000 2016-03-05 12:57:00 2016-06-05 15:57:00
173   Westpark Place    2.182353 2016-02-26 11:05:00 2016-11-03 14:13:00
174      Whitebridge    4.020588 2016-01-19 09:09:00 2016-11-03 13:42:00
175    Winston Salem  133.600000 2016-10-28 18:13:00 2016-10-28 18:13:00

[176 rows x 4 columns]

In [212]:
# res.to_csv("Sampleee.csv")

## Loops and Function

In [211]:
# Basic for loop
res = []
temp = [1,2,3,4]
for i in temp:
    res.append(i*i)
res

[1, 4, 9, 16]

In [213]:
# List comprehension way

[x*x for x in temp]

[1, 4, 9, 16]

In [214]:
store_sales = pd.read_csv("store_sales.csv")

In [215]:
store_sales.head()

,store_id,city,Jan,Feb,Mar,Apr,May,Jun,July,Aug,Sep,Oct,Nov,Dec
0,S_1,Texas,8,20,13,21,17,20,24,17,16,9,7,6
1,S_2,California,12,19,15,15,11,19,7,15,10,11,21,19
2,S_3,California,16,16,14,19,23,6,13,13,15,14,24,8
3,S_4,Texas,8,18,13,10,14,14,6,8,8,18,7,11
4,S_5,Texas,19,5,24,9,5,24,10,5,24,15,6,13

In [229]:
mean = store_sales.groupby("city")["Jan","Feb"].agg(["mean"])
mean

,level_0,index,Jan,Feb,Mar,Apr,May,Jun,July,Aug,Sep,Oct,Nov,Dec
,mean,mean,mean,mean,mean,mean,mean,mean,mean,mean,mean,mean,mean,mean
city,,,,,,,,,,,,,,
Arizona,44.681818,44.681818,15.500000,15.272727,14.545455,14.954545,14.090909,15.090909,14.636364,15.500000,15.318182,14.954545,16.409091,13.318182
California,49.674419,49.674419,14.744186,15.534884,14.627907,13.976744,13.255814,13.697674,14.813953,16.232558,14.883721,14.279070,15.279070,13.604651
Texas,52.314286,52.314286,13.457143,14.428571,14.485714,15.057143,13.600000,13.114286,13.685714,15.485714,14.685714,13.342857,14.657143,13.685714

In [ ]:
# find out avg sales for each month
# find out avg sales for each store

In [ ]:
def bonus_func(sales_numbers):
    return ["Eligible" if x > 15 else "Not Eligible" for x in sales_numbers]

In [ ]:
bonus_func([12,23,56])

In [ ]:
store_sales.iloc[:,2:].apply(bonus_func).head()

In [ ]:
store_sales.iloc[:,2:].apply(lambda sales_numbers: ["Eligible" if x > 15 else "Not Eligible" for x in sales_numbers]).head()

In [ ]:
store_sales.columns

In [ ]:
store_sales.groupby("city").agg("mean")

### Assignments

1) Find mean quarterly sales by store

2) Find the month with highest sales for each store

## Other/Miscellaneous topics

### Missing value treatment

In [ ]:
df.isnull().sum()

In [ ]:
## Count missing values
df.isnull().sum()

In [ ]:
# Fill NA with most common values
df["PURPOSE*"].value_counts()

In [ ]:
df = df.fillna({"PURPOSE*":"Meeting"})

In [ ]:
df["PURPOSE*"].value_counts()

### Matrix operations use case

### Example 1 - compute month on month growth in sales

In [ ]:
store_sales.head()

In [ ]:
sales_mat = np.array(store_sales.iloc[:,2:])

In [ ]:
sales_mat

In [ ]:
sales_mat_lag = sales_mat[:,1:]
sales_mat_lag

In [ ]:
sales_mat_lag = sales_mat[:,1:]
sales_mat_lag = np.c_[sales_mat_lag,np.zeros(100)]

In [ ]:
sales_diff = sales_mat_lag - sales_mat

In [ ]:
perct_change = pd.DataFrame(sales_diff/sales_mat)

In [ ]:
perct_change.head()

### Example 1 - compute net revenue

In [ ]:
profit_mat = np.random.uniform(low=0.05, high=0.25, size=(100,12))

In [ ]:
## Find total annual profit for each store
profit_mat = profit_mat.transpose()

In [ ]:
profit_mat.shape

In [ ]:
prof_matrix = np.dot(sales_mat,profit_mat)

In [ ]:
prof_matrix.shape